name: "rotation_rnn"
layers {
  bottom: "images"
  top: "ep_conv_5x5_2_0"
  name: "conv_5x5_2_0"
  type: CONVOLUTION
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 64
    pad: 2
    kernel_size: 5
    stride: 2
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "conv1_w"
  param: "conv1_b"
}
layers {
  bottom: "ep_conv_5x5_2_0"
  top: "ep_conv_5x5_2_0"
  name: "relu_1"
  type: RELU
}
layers {
  bottom: "ep_conv_5x5_2_0"
  top: "ep_conv_5x5_2_1"
  name: "conv_5x5_2_2"
  type: CONVOLUTION
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 128
    pad: 2
    kernel_size: 5
    stride: 2
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "conv2_w"
  param: "conv2_b"
}
layers {
  bottom: "ep_conv_5x5_2_1"
  top: "ep_conv_5x5_2_1"
  name: "relu_3"
  type: RELU
}
layers {
  bottom: "ep_conv_5x5_2_1"
  top: "ep_conv_5x5_2_2"
  name: "conv_5x5_2_4"
  type: CONVOLUTION
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 256
    pad: 2
    kernel_size: 5
    stride: 2
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "conv3_w"
  param: "conv3_b"
}
layers {
  bottom: "ep_conv_5x5_2_2"
  top: "ep_conv_5x5_2_2"
  name: "relu_5"
  type: RELU
}
layers {
  bottom: "ep_conv_5x5_2_2"
  top: "ep_inner_product_3"
  name: "inner_product_6"
  type: INNER_PRODUCT
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  inner_product_param {
    num_output: 1024
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "fc1_w"
  param: "fc1_b"
}
layers {
  bottom: "ep_inner_product_3"
  top: "ep_inner_product_3"
  name: "relu_7"
  type: RELU
}
layers {
  bottom: "ep_inner_product_3"
  top: "ep_inner_product_4"
  name: "inner_product_8"
  type: INNER_PRODUCT
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  inner_product_param {
    num_output: 1024
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "fc2_w"
  param: "fc2_b"
}
layers {
  bottom: "ep_inner_product_4"
  top: "ep_relu_5"
  name: "relu_9"
  type: RELU
}
layers {
  bottom: "ep_relu_5"
  top: "ep_split_6"
  top: "ep_split_8"
  name: "split_10"
  type: SPLIT
}
layers {
  bottom: "ep_split_6"
  top: "ep_inner_product_7"
  name: "inner_product_11"
  type: INNER_PRODUCT
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  inner_product_param {
    num_output: 512
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "fc1_id_w"
  param: "fc1_id_b"
}
layers {
  bottom: "ep_inner_product_7"
  top: "ep_inner_product_7"
  name: "relu_12"
  type: RELU
}
layers {
  bottom: "ep_inner_product_7"
  top: "ep_split_12"
  top: "ep_split_37"
  top: "ep_split_62"
  top: "ep_split_87"
  top: "ep_split_112"
  top: "ep_split_137"
  top: "ep_split_162"
  top: "ep_split_187"
  top: "ep_split_212"
  top: "ep_split_237"
  top: "ep_split_262"
  top: "ep_split_287"
  top: "ep_split_312"
  top: "ep_split_337"
  top: "ep_split_362"
  top: "ep_split_387"
  top: "ep_split_412"
  top: "ep_split_437"
  top: "ep_split_462"
  top: "ep_split_487"
  top: "ep_split_512"
  top: "ep_split_537"
  top: "ep_split_562"
  top: "ep_split_587"
  top: "ep_split_612"
  top: "ep_split_637"
  top: "ep_split_662"
  top: "ep_split_687"
  top: "ep_split_712"
  top: "ep_split_737"
  top: "ep_split_762"
  name: "split_13"
  type: SPLIT
}
layers {
  bottom: "ep_split_8"
  top: "ep_inner_product_9"
  name: "inner_product"
  type: INNER_PRODUCT
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  inner_product_param {
    num_output: 512
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "fc1_view_w"
  param: "fc1_view_b"
}
layers {
  bottom: "ep_inner_product_9"
  top: "ep_inner_product_9"
  name: "relu"
  type: RELU
}
layers {
  bottom: "ep_inner_product_9"
  bottom: "rotations0"
  top: "ep_tensor_product_10"
  name: "tensor_product_14"
  type: TENSOR_PRODUCT
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  inner_product_param {
    num_output: 512
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "tensor_view_w"
  param: "tensor_view_b"
}
layers {
  bottom: "ep_tensor_product_10"
  top: "ep_relu_11"
  name: "relu_45"
  type: RELU
}
layers {
  bottom: "ep_relu_11"
  top: "ep_split_13"
  top: "ep_split_34"
  name: "split_76"
  type: SPLIT
}
layers {
  bottom: "ep_split_12"
  bottom: "ep_split_13"
  top: "ep_concat_14"
  name: "concat_107"
  type: CONCAT
  concat_param {
    concat_dim: 1
  }
}
layers {
  bottom: "ep_concat_14"
  top: "ep_inner_product_15"
  name: "inner_product_138"
  type: INNER_PRODUCT
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  inner_product_param {
    num_output: 1024
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "dec_fc1_w"
  param: "dec_fc1_b"
}
layers {
  bottom: "ep_inner_product_15"
  top: "ep_inner_product_15"
  name: "relu_169"
  type: RELU
}
layers {
  bottom: "ep_inner_product_15"
  top: "ep_inner_product_16"
  name: "inner_product_200"
  type: INNER_PRODUCT
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  inner_product_param {
    num_output: 1024
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "dec_fc2_w"
  param: "dec_fc2_b"
}
layers {
  bottom: "ep_inner_product_16"
  top: "ep_relu_17"
  name: "relu_231"
  type: RELU
}
layers {
  bottom: "ep_relu_17"
  top: "ep_split_18"
  top: "ep_split_26"
  name: "split_262"
  type: SPLIT
}
layers {
  bottom: "ep_split_18"
  top: "ep_inner_product_19"
  name: "inner_product_293"
  type: INNER_PRODUCT
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  inner_product_param {
    num_output: 16384
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "dec_img_fc1_w"
  param: "dec_img_fc1_b"
}
layers {
  bottom: "ep_inner_product_19"
  top: "ep_inner_product_19"
  name: "relu_324"
  type: RELU
}
layers {
  bottom: "ep_inner_product_19"
  top: "ep_folding_20"
  name: "folding_355"
  type: FOLDING
  folding_param {
    channels_folded: 256
    height_folded: 8
    width_folded: 8
  }
}
layers {
  bottom: "ep_folding_20"
  top: "ep_upsample_21"
  name: "upsample_386"
  type: UPSAMPLING
  upsampling_param {
    kernel_size: 2
  }
}
layers {
  bottom: "ep_upsample_21"
  top: "ep_conv_5x5_1_22"
  name: "conv_5x5_1_417"
  type: CONVOLUTION
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 128
    pad: 2
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "dec_img_conv1_w"
  param: "dec_img_conv1_b"
}
layers {
  bottom: "ep_conv_5x5_1_22"
  top: "ep_conv_5x5_1_22"
  name: "relu_448"
  type: RELU
}
layers {
  bottom: "ep_conv_5x5_1_22"
  top: "ep_upsample_23"
  name: "upsample_479"
  type: UPSAMPLING
  upsampling_param {
    kernel_size: 2
  }
}
layers {
  bottom: "ep_upsample_23"
  top: "ep_conv_5x5_1_24"
  name: "conv_5x5_1_510"
  type: CONVOLUTION
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 64
    pad: 2
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "dec_img_conv2_w"
  param: "dec_img_conv2_b"
}
layers {
  bottom: "ep_conv_5x5_1_24"
  top: "ep_conv_5x5_1_24"
  name: "relu_541"
  type: RELU
}
layers {
  bottom: "ep_conv_5x5_1_24"
  top: "ep_upsample_25"
  name: "upsample_572"
  type: UPSAMPLING
  upsampling_param {
    kernel_size: 2
  }
}
layers {
  bottom: "ep_upsample_25"
  top: "ep_t0_conv_5x5_1_784"
  name: "t0_conv_5x5_1_603"
  type: CONVOLUTION
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 3
    pad: 2
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "dec_img_conv3_w"
  param: "dec_img_conv3_b"
}
layers {
  bottom: "ep_split_26"
  top: "ep_inner_product_27"
  name: "inner_product_634"
  type: INNER_PRODUCT
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  inner_product_param {
    num_output: 8192
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "dec_mask_fc1_w"
  param: "dec_mask_fc1_b"
}
layers {
  bottom: "ep_inner_product_27"
  top: "ep_inner_product_27"
  name: "relu_665"
  type: RELU
}
layers {
  bottom: "ep_inner_product_27"
  top: "ep_folding_28"
  name: "folding_696"
  type: FOLDING
  folding_param {
    channels_folded: 128
    height_folded: 8
    width_folded: 8
  }
}
layers {
  bottom: "ep_folding_28"
  top: "ep_upsample_29"
  name: "upsample_727"
  type: UPSAMPLING
  upsampling_param {
    kernel_size: 2
  }
}
layers {
  bottom: "ep_upsample_29"
  top: "ep_conv_5x5_1_30"
  name: "conv_5x5_1_758"
  type: CONVOLUTION
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 64
    pad: 2
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "dec_mask_conv1_w"
  param: "dec_mask_conv1_b"
}
layers {
  bottom: "ep_conv_5x5_1_30"
  top: "ep_conv_5x5_1_30"
  name: "relu_789"
  type: RELU
}
layers {
  bottom: "ep_conv_5x5_1_30"
  top: "ep_upsample_31"
  name: "upsample_820"
  type: UPSAMPLING
  upsampling_param {
    kernel_size: 2
  }
}
layers {
  bottom: "ep_upsample_31"
  top: "ep_conv_5x5_1_32"
  name: "conv_5x5_1_851"
  type: CONVOLUTION
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 32
    pad: 2
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "dec_mask_conv2_w"
  param: "dec_mask_conv2_b"
}
layers {
  bottom: "ep_conv_5x5_1_32"
  top: "ep_conv_5x5_1_32"
  name: "relu_882"
  type: RELU
}
layers {
  bottom: "ep_conv_5x5_1_32"
  top: "ep_upsample_33"
  name: "upsample_913"
  type: UPSAMPLING
  upsampling_param {
    kernel_size: 2
  }
}
layers {
  bottom: "ep_upsample_33"
  top: "ep_t0_conv_5x5_1_815"
  name: "t0_conv_5x5_1_944"
  type: CONVOLUTION
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 1
    pad: 2
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "dec_mask_conv3_w"
  param: "dec_mask_conv3_b"
}
layers {
  bottom: "ep_split_34"
  bottom: "rotations1"
  top: "ep_tensor_product_35"
  name: "tensor_product_15"
  type: TENSOR_PRODUCT
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  inner_product_param {
    num_output: 512
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "tensor_view_w"
  param: "tensor_view_b"
}
layers {
  bottom: "ep_tensor_product_35"
  top: "ep_relu_36"
  name: "relu_46"
  type: RELU
}
layers {
  bottom: "ep_relu_36"
  top: "ep_split_38"
  top: "ep_split_59"
  name: "split_77"
  type: SPLIT
}
layers {
  bottom: "ep_split_37"
  bottom: "ep_split_38"
  top: "ep_concat_39"
  name: "concat_108"
  type: CONCAT
  concat_param {
    concat_dim: 1
  }
}
layers {
  bottom: "ep_concat_39"
  top: "ep_inner_product_40"
  name: "inner_product_139"
  type: INNER_PRODUCT
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  inner_product_param {
    num_output: 1024
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "dec_fc1_w"
  param: "dec_fc1_b"
}
layers {
  bottom: "ep_inner_product_40"
  top: "ep_inner_product_40"
  name: "relu_170"
  type: RELU
}
layers {
  bottom: "ep_inner_product_40"
  top: "ep_inner_product_41"
  name: "inner_product_201"
  type: INNER_PRODUCT
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  inner_product_param {
    num_output: 1024
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "dec_fc2_w"
  param: "dec_fc2_b"
}
layers {
  bottom: "ep_inner_product_41"
  top: "ep_relu_42"
  name: "relu_232"
  type: RELU
}
layers {
  bottom: "ep_relu_42"
  top: "ep_split_43"
  top: "ep_split_51"
  name: "split_263"
  type: SPLIT
}
layers {
  bottom: "ep_split_43"
  top: "ep_inner_product_44"
  name: "inner_product_294"
  type: INNER_PRODUCT
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  inner_product_param {
    num_output: 16384
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "dec_img_fc1_w"
  param: "dec_img_fc1_b"
}
layers {
  bottom: "ep_inner_product_44"
  top: "ep_inner_product_44"
  name: "relu_325"
  type: RELU
}
layers {
  bottom: "ep_inner_product_44"
  top: "ep_folding_45"
  name: "folding_356"
  type: FOLDING
  folding_param {
    channels_folded: 256
    height_folded: 8
    width_folded: 8
  }
}
layers {
  bottom: "ep_folding_45"
  top: "ep_upsample_46"
  name: "upsample_387"
  type: UPSAMPLING
  upsampling_param {
    kernel_size: 2
  }
}
layers {
  bottom: "ep_upsample_46"
  top: "ep_conv_5x5_1_47"
  name: "conv_5x5_1_418"
  type: CONVOLUTION
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 128
    pad: 2
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "dec_img_conv1_w"
  param: "dec_img_conv1_b"
}
layers {
  bottom: "ep_conv_5x5_1_47"
  top: "ep_conv_5x5_1_47"
  name: "relu_449"
  type: RELU
}
layers {
  bottom: "ep_conv_5x5_1_47"
  top: "ep_upsample_48"
  name: "upsample_480"
  type: UPSAMPLING
  upsampling_param {
    kernel_size: 2
  }
}
layers {
  bottom: "ep_upsample_48"
  top: "ep_conv_5x5_1_49"
  name: "conv_5x5_1_511"
  type: CONVOLUTION
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 64
    pad: 2
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "dec_img_conv2_w"
  param: "dec_img_conv2_b"
}
layers {
  bottom: "ep_conv_5x5_1_49"
  top: "ep_conv_5x5_1_49"
  name: "relu_542"
  type: RELU
}
layers {
  bottom: "ep_conv_5x5_1_49"
  top: "ep_upsample_50"
  name: "upsample_573"
  type: UPSAMPLING
  upsampling_param {
    kernel_size: 2
  }
}
layers {
  bottom: "ep_upsample_50"
  top: "ep_t1_conv_5x5_1_785"
  name: "t1_conv_5x5_1_604"
  type: CONVOLUTION
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 3
    pad: 2
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "dec_img_conv3_w"
  param: "dec_img_conv3_b"
}
layers {
  bottom: "ep_split_51"
  top: "ep_inner_product_52"
  name: "inner_product_635"
  type: INNER_PRODUCT
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  inner_product_param {
    num_output: 8192
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "dec_mask_fc1_w"
  param: "dec_mask_fc1_b"
}
layers {
  bottom: "ep_inner_product_52"
  top: "ep_inner_product_52"
  name: "relu_666"
  type: RELU
}
layers {
  bottom: "ep_inner_product_52"
  top: "ep_folding_53"
  name: "folding_697"
  type: FOLDING
  folding_param {
    channels_folded: 128
    height_folded: 8
    width_folded: 8
  }
}
layers {
  bottom: "ep_folding_53"
  top: "ep_upsample_54"
  name: "upsample_728"
  type: UPSAMPLING
  upsampling_param {
    kernel_size: 2
  }
}
layers {
  bottom: "ep_upsample_54"
  top: "ep_conv_5x5_1_55"
  name: "conv_5x5_1_759"
  type: CONVOLUTION
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 64
    pad: 2
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "dec_mask_conv1_w"
  param: "dec_mask_conv1_b"
}
layers {
  bottom: "ep_conv_5x5_1_55"
  top: "ep_conv_5x5_1_55"
  name: "relu_790"
  type: RELU
}
layers {
  bottom: "ep_conv_5x5_1_55"
  top: "ep_upsample_56"
  name: "upsample_821"
  type: UPSAMPLING
  upsampling_param {
    kernel_size: 2
  }
}
layers {
  bottom: "ep_upsample_56"
  top: "ep_conv_5x5_1_57"
  name: "conv_5x5_1_852"
  type: CONVOLUTION
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 32
    pad: 2
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "dec_mask_conv2_w"
  param: "dec_mask_conv2_b"
}
layers {
  bottom: "ep_conv_5x5_1_57"
  top: "ep_conv_5x5_1_57"
  name: "relu_883"
  type: RELU
}
layers {
  bottom: "ep_conv_5x5_1_57"
  top: "ep_upsample_58"
  name: "upsample_914"
  type: UPSAMPLING
  upsampling_param {
    kernel_size: 2
  }
}
layers {
  bottom: "ep_upsample_58"
  top: "ep_t1_conv_5x5_1_816"
  name: "t1_conv_5x5_1_945"
  type: CONVOLUTION
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 1
    pad: 2
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "dec_mask_conv3_w"
  param: "dec_mask_conv3_b"
}
layers {
  bottom: "ep_split_59"
  bottom: "rotations2"
  top: "ep_tensor_product_60"
  name: "tensor_product_16"
  type: TENSOR_PRODUCT
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  inner_product_param {
    num_output: 512
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "tensor_view_w"
  param: "tensor_view_b"
}
layers {
  bottom: "ep_tensor_product_60"
  top: "ep_relu_61"
  name: "relu_47"
  type: RELU
}
layers {
  bottom: "ep_relu_61"
  top: "ep_split_63"
  top: "ep_split_84"
  name: "split_78"
  type: SPLIT
}
layers {
  bottom: "ep_split_62"
  bottom: "ep_split_63"
  top: "ep_concat_64"
  name: "concat_109"
  type: CONCAT
  concat_param {
    concat_dim: 1
  }
}
layers {
  bottom: "ep_concat_64"
  top: "ep_inner_product_65"
  name: "inner_product_140"
  type: INNER_PRODUCT
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  inner_product_param {
    num_output: 1024
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "dec_fc1_w"
  param: "dec_fc1_b"
}
layers {
  bottom: "ep_inner_product_65"
  top: "ep_inner_product_65"
  name: "relu_171"
  type: RELU
}
layers {
  bottom: "ep_inner_product_65"
  top: "ep_inner_product_66"
  name: "inner_product_202"
  type: INNER_PRODUCT
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  inner_product_param {
    num_output: 1024
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "dec_fc2_w"
  param: "dec_fc2_b"
}
layers {
  bottom: "ep_inner_product_66"
  top: "ep_relu_67"
  name: "relu_233"
  type: RELU
}
layers {
  bottom: "ep_relu_67"
  top: "ep_split_68"
  top: "ep_split_76"
  name: "split_264"
  type: SPLIT
}
layers {
  bottom: "ep_split_68"
  top: "ep_inner_product_69"
  name: "inner_product_295"
  type: INNER_PRODUCT
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  inner_product_param {
    num_output: 16384
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "dec_img_fc1_w"
  param: "dec_img_fc1_b"
}
layers {
  bottom: "ep_inner_product_69"
  top: "ep_inner_product_69"
  name: "relu_326"
  type: RELU
}
layers {
  bottom: "ep_inner_product_69"
  top: "ep_folding_70"
  name: "folding_357"
  type: FOLDING
  folding_param {
    channels_folded: 256
    height_folded: 8
    width_folded: 8
  }
}
layers {
  bottom: "ep_folding_70"
  top: "ep_upsample_71"
  name: "upsample_388"
  type: UPSAMPLING
  upsampling_param {
    kernel_size: 2
  }
}
layers {
  bottom: "ep_upsample_71"
  top: "ep_conv_5x5_1_72"
  name: "conv_5x5_1_419"
  type: CONVOLUTION
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 128
    pad: 2
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "dec_img_conv1_w"
  param: "dec_img_conv1_b"
}
layers {
  bottom: "ep_conv_5x5_1_72"
  top: "ep_conv_5x5_1_72"
  name: "relu_450"
  type: RELU
}
layers {
  bottom: "ep_conv_5x5_1_72"
  top: "ep_upsample_73"
  name: "upsample_481"
  type: UPSAMPLING
  upsampling_param {
    kernel_size: 2
  }
}
layers {
  bottom: "ep_upsample_73"
  top: "ep_conv_5x5_1_74"
  name: "conv_5x5_1_512"
  type: CONVOLUTION
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 64
    pad: 2
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "dec_img_conv2_w"
  param: "dec_img_conv2_b"
}
layers {
  bottom: "ep_conv_5x5_1_74"
  top: "ep_conv_5x5_1_74"
  name: "relu_543"
  type: RELU
}
layers {
  bottom: "ep_conv_5x5_1_74"
  top: "ep_upsample_75"
  name: "upsample_574"
  type: UPSAMPLING
  upsampling_param {
    kernel_size: 2
  }
}
layers {
  bottom: "ep_upsample_75"
  top: "ep_t2_conv_5x5_1_786"
  name: "t2_conv_5x5_1_605"
  type: CONVOLUTION
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 3
    pad: 2
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "dec_img_conv3_w"
  param: "dec_img_conv3_b"
}
layers {
  bottom: "ep_split_76"
  top: "ep_inner_product_77"
  name: "inner_product_636"
  type: INNER_PRODUCT
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  inner_product_param {
    num_output: 8192
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "dec_mask_fc1_w"
  param: "dec_mask_fc1_b"
}
layers {
  bottom: "ep_inner_product_77"
  top: "ep_inner_product_77"
  name: "relu_667"
  type: RELU
}
layers {
  bottom: "ep_inner_product_77"
  top: "ep_folding_78"
  name: "folding_698"
  type: FOLDING
  folding_param {
    channels_folded: 128
    height_folded: 8
    width_folded: 8
  }
}
layers {
  bottom: "ep_folding_78"
  top: "ep_upsample_79"
  name: "upsample_729"
  type: UPSAMPLING
  upsampling_param {
    kernel_size: 2
  }
}
layers {
  bottom: "ep_upsample_79"
  top: "ep_conv_5x5_1_80"
  name: "conv_5x5_1_760"
  type: CONVOLUTION
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 64
    pad: 2
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "dec_mask_conv1_w"
  param: "dec_mask_conv1_b"
}
layers {
  bottom: "ep_conv_5x5_1_80"
  top: "ep_conv_5x5_1_80"
  name: "relu_791"
  type: RELU
}
layers {
  bottom: "ep_conv_5x5_1_80"
  top: "ep_upsample_81"
  name: "upsample_822"
  type: UPSAMPLING
  upsampling_param {
    kernel_size: 2
  }
}
layers {
  bottom: "ep_upsample_81"
  top: "ep_conv_5x5_1_82"
  name: "conv_5x5_1_853"
  type: CONVOLUTION
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 32
    pad: 2
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "dec_mask_conv2_w"
  param: "dec_mask_conv2_b"
}
layers {
  bottom: "ep_conv_5x5_1_82"
  top: "ep_conv_5x5_1_82"
  name: "relu_884"
  type: RELU
}
layers {
  bottom: "ep_conv_5x5_1_82"
  top: "ep_upsample_83"
  name: "upsample_915"
  type: UPSAMPLING
  upsampling_param {
    kernel_size: 2
  }
}
layers {
  bottom: "ep_upsample_83"
  top: "ep_t2_conv_5x5_1_817"
  name: "t2_conv_5x5_1_946"
  type: CONVOLUTION
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 1
    pad: 2
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "dec_mask_conv3_w"
  param: "dec_mask_conv3_b"
}
layers {
  bottom: "ep_split_84"
  bottom: "rotations3"
  top: "ep_tensor_product_85"
  name: "tensor_product_17"
  type: TENSOR_PRODUCT
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  inner_product_param {
    num_output: 512
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "tensor_view_w"
  param: "tensor_view_b"
}
layers {
  bottom: "ep_tensor_product_85"
  top: "ep_relu_86"
  name: "relu_48"
  type: RELU
}
layers {
  bottom: "ep_relu_86"
  top: "ep_split_88"
  top: "ep_split_109"
  name: "split_79"
  type: SPLIT
}
layers {
  bottom: "ep_split_87"
  bottom: "ep_split_88"
  top: "ep_concat_89"
  name: "concat_110"
  type: CONCAT
  concat_param {
    concat_dim: 1
  }
}
layers {
  bottom: "ep_concat_89"
  top: "ep_inner_product_90"
  name: "inner_product_141"
  type: INNER_PRODUCT
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  inner_product_param {
    num_output: 1024
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "dec_fc1_w"
  param: "dec_fc1_b"
}
layers {
  bottom: "ep_inner_product_90"
  top: "ep_inner_product_90"
  name: "relu_172"
  type: RELU
}
layers {
  bottom: "ep_inner_product_90"
  top: "ep_inner_product_91"
  name: "inner_product_203"
  type: INNER_PRODUCT
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  inner_product_param {
    num_output: 1024
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "dec_fc2_w"
  param: "dec_fc2_b"
}
layers {
  bottom: "ep_inner_product_91"
  top: "ep_relu_92"
  name: "relu_234"
  type: RELU
}
layers {
  bottom: "ep_relu_92"
  top: "ep_split_93"
  top: "ep_split_101"
  name: "split_265"
  type: SPLIT
}
layers {
  bottom: "ep_split_93"
  top: "ep_inner_product_94"
  name: "inner_product_296"
  type: INNER_PRODUCT
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  inner_product_param {
    num_output: 16384
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "dec_img_fc1_w"
  param: "dec_img_fc1_b"
}
layers {
  bottom: "ep_inner_product_94"
  top: "ep_inner_product_94"
  name: "relu_327"
  type: RELU
}
layers {
  bottom: "ep_inner_product_94"
  top: "ep_folding_95"
  name: "folding_358"
  type: FOLDING
  folding_param {
    channels_folded: 256
    height_folded: 8
    width_folded: 8
  }
}
layers {
  bottom: "ep_folding_95"
  top: "ep_upsample_96"
  name: "upsample_389"
  type: UPSAMPLING
  upsampling_param {
    kernel_size: 2
  }
}
layers {
  bottom: "ep_upsample_96"
  top: "ep_conv_5x5_1_97"
  name: "conv_5x5_1_420"
  type: CONVOLUTION
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 128
    pad: 2
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "dec_img_conv1_w"
  param: "dec_img_conv1_b"
}
layers {
  bottom: "ep_conv_5x5_1_97"
  top: "ep_conv_5x5_1_97"
  name: "relu_451"
  type: RELU
}
layers {
  bottom: "ep_conv_5x5_1_97"
  top: "ep_upsample_98"
  name: "upsample_482"
  type: UPSAMPLING
  upsampling_param {
    kernel_size: 2
  }
}
layers {
  bottom: "ep_upsample_98"
  top: "ep_conv_5x5_1_99"
  name: "conv_5x5_1_513"
  type: CONVOLUTION
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 64
    pad: 2
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "dec_img_conv2_w"
  param: "dec_img_conv2_b"
}
layers {
  bottom: "ep_conv_5x5_1_99"
  top: "ep_conv_5x5_1_99"
  name: "relu_544"
  type: RELU
}
layers {
  bottom: "ep_conv_5x5_1_99"
  top: "ep_upsample_100"
  name: "upsample_575"
  type: UPSAMPLING
  upsampling_param {
    kernel_size: 2
  }
}
layers {
  bottom: "ep_upsample_100"
  top: "ep_t3_conv_5x5_1_787"
  name: "t3_conv_5x5_1_606"
  type: CONVOLUTION
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 3
    pad: 2
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "dec_img_conv3_w"
  param: "dec_img_conv3_b"
}
layers {
  bottom: "ep_split_101"
  top: "ep_inner_product_102"
  name: "inner_product_637"
  type: INNER_PRODUCT
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  inner_product_param {
    num_output: 8192
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "dec_mask_fc1_w"
  param: "dec_mask_fc1_b"
}
layers {
  bottom: "ep_inner_product_102"
  top: "ep_inner_product_102"
  name: "relu_668"
  type: RELU
}
layers {
  bottom: "ep_inner_product_102"
  top: "ep_folding_103"
  name: "folding_699"
  type: FOLDING
  folding_param {
    channels_folded: 128
    height_folded: 8
    width_folded: 8
  }
}
layers {
  bottom: "ep_folding_103"
  top: "ep_upsample_104"
  name: "upsample_730"
  type: UPSAMPLING
  upsampling_param {
    kernel_size: 2
  }
}
layers {
  bottom: "ep_upsample_104"
  top: "ep_conv_5x5_1_105"
  name: "conv_5x5_1_761"
  type: CONVOLUTION
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 64
    pad: 2
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "dec_mask_conv1_w"
  param: "dec_mask_conv1_b"
}
layers {
  bottom: "ep_conv_5x5_1_105"
  top: "ep_conv_5x5_1_105"
  name: "relu_792"
  type: RELU
}
layers {
  bottom: "ep_conv_5x5_1_105"
  top: "ep_upsample_106"
  name: "upsample_823"
  type: UPSAMPLING
  upsampling_param {
    kernel_size: 2
  }
}
layers {
  bottom: "ep_upsample_106"
  top: "ep_conv_5x5_1_107"
  name: "conv_5x5_1_854"
  type: CONVOLUTION
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 32
    pad: 2
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "dec_mask_conv2_w"
  param: "dec_mask_conv2_b"
}
layers {
  bottom: "ep_conv_5x5_1_107"
  top: "ep_conv_5x5_1_107"
  name: "relu_885"
  type: RELU
}
layers {
  bottom: "ep_conv_5x5_1_107"
  top: "ep_upsample_108"
  name: "upsample_916"
  type: UPSAMPLING
  upsampling_param {
    kernel_size: 2
  }
}
layers {
  bottom: "ep_upsample_108"
  top: "ep_t3_conv_5x5_1_818"
  name: "t3_conv_5x5_1_947"
  type: CONVOLUTION
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 1
    pad: 2
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "dec_mask_conv3_w"
  param: "dec_mask_conv3_b"
}
layers {
  bottom: "ep_split_109"
  bottom: "rotations4"
  top: "ep_tensor_product_110"
  name: "tensor_product_18"
  type: TENSOR_PRODUCT
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  inner_product_param {
    num_output: 512
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "tensor_view_w"
  param: "tensor_view_b"
}
layers {
  bottom: "ep_tensor_product_110"
  top: "ep_relu_111"
  name: "relu_49"
  type: RELU
}
layers {
  bottom: "ep_relu_111"
  top: "ep_split_113"
  top: "ep_split_134"
  name: "split_80"
  type: SPLIT
}
layers {
  bottom: "ep_split_112"
  bottom: "ep_split_113"
  top: "ep_concat_114"
  name: "concat_111"
  type: CONCAT
  concat_param {
    concat_dim: 1
  }
}
layers {
  bottom: "ep_concat_114"
  top: "ep_inner_product_115"
  name: "inner_product_142"
  type: INNER_PRODUCT
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  inner_product_param {
    num_output: 1024
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "dec_fc1_w"
  param: "dec_fc1_b"
}
layers {
  bottom: "ep_inner_product_115"
  top: "ep_inner_product_115"
  name: "relu_173"
  type: RELU
}
layers {
  bottom: "ep_inner_product_115"
  top: "ep_inner_product_116"
  name: "inner_product_204"
  type: INNER_PRODUCT
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  inner_product_param {
    num_output: 1024
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "dec_fc2_w"
  param: "dec_fc2_b"
}
layers {
  bottom: "ep_inner_product_116"
  top: "ep_relu_117"
  name: "relu_235"
  type: RELU
}
layers {
  bottom: "ep_relu_117"
  top: "ep_split_118"
  top: "ep_split_126"
  name: "split_266"
  type: SPLIT
}
layers {
  bottom: "ep_split_118"
  top: "ep_inner_product_119"
  name: "inner_product_297"
  type: INNER_PRODUCT
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  inner_product_param {
    num_output: 16384
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "dec_img_fc1_w"
  param: "dec_img_fc1_b"
}
layers {
  bottom: "ep_inner_product_119"
  top: "ep_inner_product_119"
  name: "relu_328"
  type: RELU
}
layers {
  bottom: "ep_inner_product_119"
  top: "ep_folding_120"
  name: "folding_359"
  type: FOLDING
  folding_param {
    channels_folded: 256
    height_folded: 8
    width_folded: 8
  }
}
layers {
  bottom: "ep_folding_120"
  top: "ep_upsample_121"
  name: "upsample_390"
  type: UPSAMPLING
  upsampling_param {
    kernel_size: 2
  }
}
layers {
  bottom: "ep_upsample_121"
  top: "ep_conv_5x5_1_122"
  name: "conv_5x5_1_421"
  type: CONVOLUTION
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 128
    pad: 2
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "dec_img_conv1_w"
  param: "dec_img_conv1_b"
}
layers {
  bottom: "ep_conv_5x5_1_122"
  top: "ep_conv_5x5_1_122"
  name: "relu_452"
  type: RELU
}
layers {
  bottom: "ep_conv_5x5_1_122"
  top: "ep_upsample_123"
  name: "upsample_483"
  type: UPSAMPLING
  upsampling_param {
    kernel_size: 2
  }
}
layers {
  bottom: "ep_upsample_123"
  top: "ep_conv_5x5_1_124"
  name: "conv_5x5_1_514"
  type: CONVOLUTION
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 64
    pad: 2
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "dec_img_conv2_w"
  param: "dec_img_conv2_b"
}
layers {
  bottom: "ep_conv_5x5_1_124"
  top: "ep_conv_5x5_1_124"
  name: "relu_545"
  type: RELU
}
layers {
  bottom: "ep_conv_5x5_1_124"
  top: "ep_upsample_125"
  name: "upsample_576"
  type: UPSAMPLING
  upsampling_param {
    kernel_size: 2
  }
}
layers {
  bottom: "ep_upsample_125"
  top: "ep_t4_conv_5x5_1_788"
  name: "t4_conv_5x5_1_607"
  type: CONVOLUTION
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 3
    pad: 2
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "dec_img_conv3_w"
  param: "dec_img_conv3_b"
}
layers {
  bottom: "ep_split_126"
  top: "ep_inner_product_127"
  name: "inner_product_638"
  type: INNER_PRODUCT
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  inner_product_param {
    num_output: 8192
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "dec_mask_fc1_w"
  param: "dec_mask_fc1_b"
}
layers {
  bottom: "ep_inner_product_127"
  top: "ep_inner_product_127"
  name: "relu_669"
  type: RELU
}
layers {
  bottom: "ep_inner_product_127"
  top: "ep_folding_128"
  name: "folding_700"
  type: FOLDING
  folding_param {
    channels_folded: 128
    height_folded: 8
    width_folded: 8
  }
}
layers {
  bottom: "ep_folding_128"
  top: "ep_upsample_129"
  name: "upsample_731"
  type: UPSAMPLING
  upsampling_param {
    kernel_size: 2
  }
}
layers {
  bottom: "ep_upsample_129"
  top: "ep_conv_5x5_1_130"
  name: "conv_5x5_1_762"
  type: CONVOLUTION
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 64
    pad: 2
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "dec_mask_conv1_w"
  param: "dec_mask_conv1_b"
}
layers {
  bottom: "ep_conv_5x5_1_130"
  top: "ep_conv_5x5_1_130"
  name: "relu_793"
  type: RELU
}
layers {
  bottom: "ep_conv_5x5_1_130"
  top: "ep_upsample_131"
  name: "upsample_824"
  type: UPSAMPLING
  upsampling_param {
    kernel_size: 2
  }
}
layers {
  bottom: "ep_upsample_131"
  top: "ep_conv_5x5_1_132"
  name: "conv_5x5_1_855"
  type: CONVOLUTION
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 32
    pad: 2
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "dec_mask_conv2_w"
  param: "dec_mask_conv2_b"
}
layers {
  bottom: "ep_conv_5x5_1_132"
  top: "ep_conv_5x5_1_132"
  name: "relu_886"
  type: RELU
}
layers {
  bottom: "ep_conv_5x5_1_132"
  top: "ep_upsample_133"
  name: "upsample_917"
  type: UPSAMPLING
  upsampling_param {
    kernel_size: 2
  }
}
layers {
  bottom: "ep_upsample_133"
  top: "ep_t4_conv_5x5_1_819"
  name: "t4_conv_5x5_1_948"
  type: CONVOLUTION
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 1
    pad: 2
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "dec_mask_conv3_w"
  param: "dec_mask_conv3_b"
}
layers {
  bottom: "ep_split_134"
  bottom: "rotations5"
  top: "ep_tensor_product_135"
  name: "tensor_product_19"
  type: TENSOR_PRODUCT
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  inner_product_param {
    num_output: 512
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "tensor_view_w"
  param: "tensor_view_b"
}
layers {
  bottom: "ep_tensor_product_135"
  top: "ep_relu_136"
  name: "relu_50"
  type: RELU
}
layers {
  bottom: "ep_relu_136"
  top: "ep_split_138"
  top: "ep_split_159"
  name: "split_81"
  type: SPLIT
}
layers {
  bottom: "ep_split_137"
  bottom: "ep_split_138"
  top: "ep_concat_139"
  name: "concat_112"
  type: CONCAT
  concat_param {
    concat_dim: 1
  }
}
layers {
  bottom: "ep_concat_139"
  top: "ep_inner_product_140"
  name: "inner_product_143"
  type: INNER_PRODUCT
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  inner_product_param {
    num_output: 1024
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "dec_fc1_w"
  param: "dec_fc1_b"
}
layers {
  bottom: "ep_inner_product_140"
  top: "ep_inner_product_140"
  name: "relu_174"
  type: RELU
}
layers {
  bottom: "ep_inner_product_140"
  top: "ep_inner_product_141"
  name: "inner_product_205"
  type: INNER_PRODUCT
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  inner_product_param {
    num_output: 1024
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "dec_fc2_w"
  param: "dec_fc2_b"
}
layers {
  bottom: "ep_inner_product_141"
  top: "ep_relu_142"
  name: "relu_236"
  type: RELU
}
layers {
  bottom: "ep_relu_142"
  top: "ep_split_143"
  top: "ep_split_151"
  name: "split_267"
  type: SPLIT
}
layers {
  bottom: "ep_split_143"
  top: "ep_inner_product_144"
  name: "inner_product_298"
  type: INNER_PRODUCT
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  inner_product_param {
    num_output: 16384
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "dec_img_fc1_w"
  param: "dec_img_fc1_b"
}
layers {
  bottom: "ep_inner_product_144"
  top: "ep_inner_product_144"
  name: "relu_329"
  type: RELU
}
layers {
  bottom: "ep_inner_product_144"
  top: "ep_folding_145"
  name: "folding_360"
  type: FOLDING
  folding_param {
    channels_folded: 256
    height_folded: 8
    width_folded: 8
  }
}
layers {
  bottom: "ep_folding_145"
  top: "ep_upsample_146"
  name: "upsample_391"
  type: UPSAMPLING
  upsampling_param {
    kernel_size: 2
  }
}
layers {
  bottom: "ep_upsample_146"
  top: "ep_conv_5x5_1_147"
  name: "conv_5x5_1_422"
  type: CONVOLUTION
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 128
    pad: 2
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "dec_img_conv1_w"
  param: "dec_img_conv1_b"
}
layers {
  bottom: "ep_conv_5x5_1_147"
  top: "ep_conv_5x5_1_147"
  name: "relu_453"
  type: RELU
}
layers {
  bottom: "ep_conv_5x5_1_147"
  top: "ep_upsample_148"
  name: "upsample_484"
  type: UPSAMPLING
  upsampling_param {
    kernel_size: 2
  }
}
layers {
  bottom: "ep_upsample_148"
  top: "ep_conv_5x5_1_149"
  name: "conv_5x5_1_515"
  type: CONVOLUTION
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 64
    pad: 2
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "dec_img_conv2_w"
  param: "dec_img_conv2_b"
}
layers {
  bottom: "ep_conv_5x5_1_149"
  top: "ep_conv_5x5_1_149"
  name: "relu_546"
  type: RELU
}
layers {
  bottom: "ep_conv_5x5_1_149"
  top: "ep_upsample_150"
  name: "upsample_577"
  type: UPSAMPLING
  upsampling_param {
    kernel_size: 2
  }
}
layers {
  bottom: "ep_upsample_150"
  top: "ep_t5_conv_5x5_1_789"
  name: "t5_conv_5x5_1_608"
  type: CONVOLUTION
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 3
    pad: 2
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "dec_img_conv3_w"
  param: "dec_img_conv3_b"
}
layers {
  bottom: "ep_split_151"
  top: "ep_inner_product_152"
  name: "inner_product_639"
  type: INNER_PRODUCT
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  inner_product_param {
    num_output: 8192
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "dec_mask_fc1_w"
  param: "dec_mask_fc1_b"
}
layers {
  bottom: "ep_inner_product_152"
  top: "ep_inner_product_152"
  name: "relu_670"
  type: RELU
}
layers {
  bottom: "ep_inner_product_152"
  top: "ep_folding_153"
  name: "folding_701"
  type: FOLDING
  folding_param {
    channels_folded: 128
    height_folded: 8
    width_folded: 8
  }
}
layers {
  bottom: "ep_folding_153"
  top: "ep_upsample_154"
  name: "upsample_732"
  type: UPSAMPLING
  upsampling_param {
    kernel_size: 2
  }
}
layers {
  bottom: "ep_upsample_154"
  top: "ep_conv_5x5_1_155"
  name: "conv_5x5_1_763"
  type: CONVOLUTION
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 64
    pad: 2
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "dec_mask_conv1_w"
  param: "dec_mask_conv1_b"
}
layers {
  bottom: "ep_conv_5x5_1_155"
  top: "ep_conv_5x5_1_155"
  name: "relu_794"
  type: RELU
}
layers {
  bottom: "ep_conv_5x5_1_155"
  top: "ep_upsample_156"
  name: "upsample_825"
  type: UPSAMPLING
  upsampling_param {
    kernel_size: 2
  }
}
layers {
  bottom: "ep_upsample_156"
  top: "ep_conv_5x5_1_157"
  name: "conv_5x5_1_856"
  type: CONVOLUTION
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 32
    pad: 2
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "dec_mask_conv2_w"
  param: "dec_mask_conv2_b"
}
layers {
  bottom: "ep_conv_5x5_1_157"
  top: "ep_conv_5x5_1_157"
  name: "relu_887"
  type: RELU
}
layers {
  bottom: "ep_conv_5x5_1_157"
  top: "ep_upsample_158"
  name: "upsample_918"
  type: UPSAMPLING
  upsampling_param {
    kernel_size: 2
  }
}
layers {
  bottom: "ep_upsample_158"
  top: "ep_t5_conv_5x5_1_820"
  name: "t5_conv_5x5_1_949"
  type: CONVOLUTION
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 1
    pad: 2
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "dec_mask_conv3_w"
  param: "dec_mask_conv3_b"
}
layers {
  bottom: "ep_split_159"
  bottom: "rotations6"
  top: "ep_tensor_product_160"
  name: "tensor_product_20"
  type: TENSOR_PRODUCT
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  inner_product_param {
    num_output: 512
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "tensor_view_w"
  param: "tensor_view_b"
}
layers {
  bottom: "ep_tensor_product_160"
  top: "ep_relu_161"
  name: "relu_51"
  type: RELU
}
layers {
  bottom: "ep_relu_161"
  top: "ep_split_163"
  top: "ep_split_184"
  name: "split_82"
  type: SPLIT
}
layers {
  bottom: "ep_split_162"
  bottom: "ep_split_163"
  top: "ep_concat_164"
  name: "concat_113"
  type: CONCAT
  concat_param {
    concat_dim: 1
  }
}
layers {
  bottom: "ep_concat_164"
  top: "ep_inner_product_165"
  name: "inner_product_144"
  type: INNER_PRODUCT
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  inner_product_param {
    num_output: 1024
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "dec_fc1_w"
  param: "dec_fc1_b"
}
layers {
  bottom: "ep_inner_product_165"
  top: "ep_inner_product_165"
  name: "relu_175"
  type: RELU
}
layers {
  bottom: "ep_inner_product_165"
  top: "ep_inner_product_166"
  name: "inner_product_206"
  type: INNER_PRODUCT
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  inner_product_param {
    num_output: 1024
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "dec_fc2_w"
  param: "dec_fc2_b"
}
layers {
  bottom: "ep_inner_product_166"
  top: "ep_relu_167"
  name: "relu_237"
  type: RELU
}
layers {
  bottom: "ep_relu_167"
  top: "ep_split_168"
  top: "ep_split_176"
  name: "split_268"
  type: SPLIT
}
layers {
  bottom: "ep_split_168"
  top: "ep_inner_product_169"
  name: "inner_product_299"
  type: INNER_PRODUCT
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  inner_product_param {
    num_output: 16384
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "dec_img_fc1_w"
  param: "dec_img_fc1_b"
}
layers {
  bottom: "ep_inner_product_169"
  top: "ep_inner_product_169"
  name: "relu_330"
  type: RELU
}
layers {
  bottom: "ep_inner_product_169"
  top: "ep_folding_170"
  name: "folding_361"
  type: FOLDING
  folding_param {
    channels_folded: 256
    height_folded: 8
    width_folded: 8
  }
}
layers {
  bottom: "ep_folding_170"
  top: "ep_upsample_171"
  name: "upsample_392"
  type: UPSAMPLING
  upsampling_param {
    kernel_size: 2
  }
}
layers {
  bottom: "ep_upsample_171"
  top: "ep_conv_5x5_1_172"
  name: "conv_5x5_1_423"
  type: CONVOLUTION
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 128
    pad: 2
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
