name: "rotation_rnn"
layers {
  bottom: "images"
  top: "ep_conv_5x5_2_0"
  name: "conv_5x5_2_0"
  type: CONVOLUTION
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 64
    pad: 2
    kernel_size: 5
    stride: 2
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "conv1_w"
  param: "conv1_b"
}
layers {
  bottom: "ep_conv_5x5_2_0"
  top: "ep_conv_5x5_2_0"
  name: "relu_1"
  type: RELU
}
layers {
  bottom: "ep_conv_5x5_2_0"
  top: "ep_conv_5x5_2_1"
  name: "conv_5x5_2_2"
  type: CONVOLUTION
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 128
    pad: 2
    kernel_size: 5
    stride: 2
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "conv2_w"
  param: "conv2_b"
}
layers {
  bottom: "ep_conv_5x5_2_1"
  top: "ep_conv_5x5_2_1"
  name: "relu_3"
  type: RELU
}
layers {
  bottom: "ep_conv_5x5_2_1"
  top: "ep_conv_5x5_2_2"
  name: "conv_5x5_2_4"
  type: CONVOLUTION
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 256
    pad: 2
    kernel_size: 5
    stride: 2
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "conv3_w"
  param: "conv3_b"
}
layers {
  bottom: "ep_conv_5x5_2_2"
  top: "ep_conv_5x5_2_2"
  name: "relu_5"
  type: RELU
}
layers {
  bottom: "ep_conv_5x5_2_2"
  top: "ep_inner_product_3"
  name: "inner_product_6"
  type: INNER_PRODUCT
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  inner_product_param {
    num_output: 1024
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "fc1_w"
  param: "fc1_b"
}
layers {
  bottom: "ep_inner_product_3"
  top: "ep_inner_product_3"
  name: "relu_7"
  type: RELU
}
layers {
  bottom: "ep_inner_product_3"
  top: "ep_inner_product_4"
  name: "inner_product_8"
  type: INNER_PRODUCT
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  inner_product_param {
    num_output: 1024
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "fc2_w"
  param: "fc2_b"
}
layers {
  bottom: "ep_inner_product_4"
  top: "ep_relu_5"
  name: "relu_9"
  type: RELU
}
layers {
  bottom: "ep_relu_5"
  top: "ep_split_6"
  top: "ep_split_8"
  name: "split_10"
  type: SPLIT
}
layers {
  bottom: "ep_split_6"
  top: "ep_inner_product_7"
  name: "inner_product_11"
  type: INNER_PRODUCT
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  inner_product_param {
    num_output: 512
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "fc1_id_w"
  param: "fc1_id_b"
}
layers {
  bottom: "ep_inner_product_7"
  top: "ep_inner_product_7"
  name: "relu_12"
  type: RELU
}
layers {
  bottom: "ep_inner_product_7"
  top: "ep_split_12"
  top: "ep_split_37"
  top: "ep_split_62"
  top: "ep_split_87"
  top: "ep_split_112"
  top: "ep_split_137"
  top: "ep_split_162"
  top: "ep_split_187"
  top: "ep_split_212"
  top: "ep_split_237"
  top: "ep_split_262"
  top: "ep_split_287"
  top: "ep_split_312"
  top: "ep_split_337"
  top: "ep_split_362"
  top: "ep_split_387"
  name: "split_13"
  type: SPLIT
}
layers {
  bottom: "ep_split_8"
  top: "ep_inner_product_9"
  name: "inner_product"
  type: INNER_PRODUCT
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  inner_product_param {
    num_output: 512
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "fc1_view_w"
  param: "fc1_view_b"
}
layers {
  bottom: "ep_inner_product_9"
  top: "ep_inner_product_9"
  name: "relu"
  type: RELU
}
layers {
  bottom: "ep_inner_product_9"
  bottom: "rotations0"
  top: "ep_tensor_product_10"
  name: "tensor_product_14"
  type: TENSOR_PRODUCT
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  inner_product_param {
    num_output: 512
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "tensor_view_w"
  param: "tensor_view_b"
}
layers {
  bottom: "ep_tensor_product_10"
  top: "ep_relu_11"
  name: "relu_30"
  type: RELU
}
layers {
  bottom: "ep_relu_11"
  top: "ep_split_13"
  top: "ep_split_34"
  name: "split_46"
  type: SPLIT
}
layers {
  bottom: "ep_split_12"
  bottom: "ep_split_13"
  top: "ep_concat_14"
  name: "concat_62"
  type: CONCAT
  concat_param {
    concat_dim: 1
  }
}
layers {
  bottom: "ep_concat_14"
  top: "ep_inner_product_15"
  name: "inner_product_78"
  type: INNER_PRODUCT
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  inner_product_param {
    num_output: 1024
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "dec_fc1_w"
  param: "dec_fc1_b"
}
layers {
  bottom: "ep_inner_product_15"
  top: "ep_inner_product_15"
  name: "relu_94"
  type: RELU
}
layers {
  bottom: "ep_inner_product_15"
  top: "ep_inner_product_16"
  name: "inner_product_110"
  type: INNER_PRODUCT
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  inner_product_param {
    num_output: 1024
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "dec_fc2_w"
  param: "dec_fc2_b"
}
layers {
  bottom: "ep_inner_product_16"
  top: "ep_relu_17"
  name: "relu_126"
  type: RELU
}
layers {
  bottom: "ep_relu_17"
  top: "ep_split_18"
  top: "ep_split_26"
  name: "split_142"
  type: SPLIT
}
layers {
  bottom: "ep_split_18"
  top: "ep_inner_product_19"
  name: "inner_product_158"
  type: INNER_PRODUCT
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  inner_product_param {
    num_output: 16384
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "dec_img_fc1_w"
  param: "dec_img_fc1_b"
}
layers {
  bottom: "ep_inner_product_19"
  top: "ep_inner_product_19"
  name: "relu_174"
  type: RELU
}
layers {
  bottom: "ep_inner_product_19"
  top: "ep_folding_20"
  name: "folding_190"
  type: FOLDING
  folding_param {
    channels_folded: 256
    height_folded: 8
    width_folded: 8
  }
}
layers {
  bottom: "ep_folding_20"
  top: "ep_upsample_21"
  name: "upsample_206"
  type: UPSAMPLING
  upsampling_param {
    kernel_size: 2
  }
}
layers {
  bottom: "ep_upsample_21"
  top: "ep_conv_5x5_1_22"
  name: "conv_5x5_1_222"
  type: CONVOLUTION
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 128
    pad: 2
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "dec_img_conv1_w"
  param: "dec_img_conv1_b"
}
layers {
  bottom: "ep_conv_5x5_1_22"
  top: "ep_conv_5x5_1_22"
  name: "relu_238"
  type: RELU
}
layers {
  bottom: "ep_conv_5x5_1_22"
  top: "ep_upsample_23"
  name: "upsample_254"
  type: UPSAMPLING
  upsampling_param {
    kernel_size: 2
  }
}
layers {
  bottom: "ep_upsample_23"
  top: "ep_conv_5x5_1_24"
  name: "conv_5x5_1_270"
  type: CONVOLUTION
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 64
    pad: 2
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "dec_img_conv2_w"
  param: "dec_img_conv2_b"
}
layers {
  bottom: "ep_conv_5x5_1_24"
  top: "ep_conv_5x5_1_24"
  name: "relu_286"
  type: RELU
}
layers {
  bottom: "ep_conv_5x5_1_24"
  top: "ep_upsample_25"
  name: "upsample_302"
  type: UPSAMPLING
  upsampling_param {
    kernel_size: 2
  }
}
layers {
  bottom: "ep_upsample_25"
  top: "ep_t0_conv_5x5_1_409"
  name: "t0_conv_5x5_1_318"
  type: CONVOLUTION
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 3
    pad: 2
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "dec_img_conv3_w"
  param: "dec_img_conv3_b"
}
layers {
  bottom: "ep_split_26"
  top: "ep_inner_product_27"
  name: "inner_product_334"
  type: INNER_PRODUCT
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  inner_product_param {
    num_output: 8192
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "dec_mask_fc1_w"
  param: "dec_mask_fc1_b"
}
layers {
  bottom: "ep_inner_product_27"
  top: "ep_inner_product_27"
  name: "relu_350"
  type: RELU
}
layers {
  bottom: "ep_inner_product_27"
  top: "ep_folding_28"
  name: "folding_366"
  type: FOLDING
  folding_param {
    channels_folded: 128
    height_folded: 8
    width_folded: 8
  }
}
layers {
  bottom: "ep_folding_28"
  top: "ep_upsample_29"
  name: "upsample_382"
  type: UPSAMPLING
  upsampling_param {
    kernel_size: 2
  }
}
layers {
  bottom: "ep_upsample_29"
  top: "ep_conv_5x5_1_30"
  name: "conv_5x5_1_398"
  type: CONVOLUTION
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 64
    pad: 2
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "dec_mask_conv1_w"
  param: "dec_mask_conv1_b"
}
layers {
  bottom: "ep_conv_5x5_1_30"
  top: "ep_conv_5x5_1_30"
  name: "relu_414"
  type: RELU
}
layers {
  bottom: "ep_conv_5x5_1_30"
  top: "ep_upsample_31"
  name: "upsample_430"
  type: UPSAMPLING
  upsampling_param {
    kernel_size: 2
  }
}
layers {
  bottom: "ep_upsample_31"
  top: "ep_conv_5x5_1_32"
  name: "conv_5x5_1_446"
  type: CONVOLUTION
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 32
    pad: 2
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "dec_mask_conv2_w"
  param: "dec_mask_conv2_b"
}
layers {
  bottom: "ep_conv_5x5_1_32"
  top: "ep_conv_5x5_1_32"
  name: "relu_462"
  type: RELU
}
layers {
  bottom: "ep_conv_5x5_1_32"
  top: "ep_upsample_33"
  name: "upsample_478"
  type: UPSAMPLING
  upsampling_param {
    kernel_size: 2
  }
}
layers {
  bottom: "ep_upsample_33"
  top: "ep_t0_conv_5x5_1_425"
  name: "t0_conv_5x5_1_494"
  type: CONVOLUTION
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 1
    pad: 2
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "dec_mask_conv3_w"
  param: "dec_mask_conv3_b"
}
layers {
  bottom: "ep_split_34"
  bottom: "rotations1"
  top: "ep_tensor_product_35"
  name: "tensor_product_15"
  type: TENSOR_PRODUCT
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  inner_product_param {
    num_output: 512
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "tensor_view_w"
  param: "tensor_view_b"
}
layers {
  bottom: "ep_tensor_product_35"
  top: "ep_relu_36"
  name: "relu_31"
  type: RELU
}
layers {
  bottom: "ep_relu_36"
  top: "ep_split_38"
  top: "ep_split_59"
  name: "split_47"
  type: SPLIT
}
layers {
  bottom: "ep_split_37"
  bottom: "ep_split_38"
  top: "ep_concat_39"
  name: "concat_63"
  type: CONCAT
  concat_param {
    concat_dim: 1
  }
}
layers {
  bottom: "ep_concat_39"
  top: "ep_inner_product_40"
  name: "inner_product_79"
  type: INNER_PRODUCT
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  inner_product_param {
    num_output: 1024
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "dec_fc1_w"
  param: "dec_fc1_b"
}
layers {
  bottom: "ep_inner_product_40"
  top: "ep_inner_product_40"
  name: "relu_95"
  type: RELU
}
layers {
  bottom: "ep_inner_product_40"
  top: "ep_inner_product_41"
  name: "inner_product_111"
  type: INNER_PRODUCT
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  inner_product_param {
    num_output: 1024
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "dec_fc2_w"
  param: "dec_fc2_b"
}
layers {
  bottom: "ep_inner_product_41"
  top: "ep_relu_42"
  name: "relu_127"
  type: RELU
}
layers {
  bottom: "ep_relu_42"
  top: "ep_split_43"
  top: "ep_split_51"
  name: "split_143"
  type: SPLIT
}
layers {
  bottom: "ep_split_43"
  top: "ep_inner_product_44"
  name: "inner_product_159"
  type: INNER_PRODUCT
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  inner_product_param {
    num_output: 16384
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "dec_img_fc1_w"
  param: "dec_img_fc1_b"
}
layers {
  bottom: "ep_inner_product_44"
  top: "ep_inner_product_44"
  name: "relu_175"
  type: RELU
}
layers {
  bottom: "ep_inner_product_44"
  top: "ep_folding_45"
  name: "folding_191"
  type: FOLDING
  folding_param {
    channels_folded: 256
    height_folded: 8
    width_folded: 8
  }
}
layers {
  bottom: "ep_folding_45"
  top: "ep_upsample_46"
  name: "upsample_207"
  type: UPSAMPLING
  upsampling_param {
    kernel_size: 2
  }
}
layers {
  bottom: "ep_upsample_46"
  top: "ep_conv_5x5_1_47"
  name: "conv_5x5_1_223"
  type: CONVOLUTION
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 128
    pad: 2
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "dec_img_conv1_w"
  param: "dec_img_conv1_b"
}
layers {
  bottom: "ep_conv_5x5_1_47"
  top: "ep_conv_5x5_1_47"
  name: "relu_239"
  type: RELU
}
layers {
  bottom: "ep_conv_5x5_1_47"
  top: "ep_upsample_48"
  name: "upsample_255"
  type: UPSAMPLING
  upsampling_param {
    kernel_size: 2
  }
}
layers {
  bottom: "ep_upsample_48"
  top: "ep_conv_5x5_1_49"
  name: "conv_5x5_1_271"
  type: CONVOLUTION
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 64
    pad: 2
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "dec_img_conv2_w"
  param: "dec_img_conv2_b"
}
layers {
  bottom: "ep_conv_5x5_1_49"
  top: "ep_conv_5x5_1_49"
  name: "relu_287"
  type: RELU
}
layers {
  bottom: "ep_conv_5x5_1_49"
  top: "ep_upsample_50"
  name: "upsample_303"
  type: UPSAMPLING
  upsampling_param {
    kernel_size: 2
  }
}
layers {
  bottom: "ep_upsample_50"
  top: "ep_t1_conv_5x5_1_410"
  name: "t1_conv_5x5_1_319"
  type: CONVOLUTION
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 3
    pad: 2
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "dec_img_conv3_w"
  param: "dec_img_conv3_b"
}
layers {
  bottom: "ep_split_51"
  top: "ep_inner_product_52"
  name: "inner_product_335"
  type: INNER_PRODUCT
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  inner_product_param {
    num_output: 8192
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "dec_mask_fc1_w"
  param: "dec_mask_fc1_b"
}
layers {
  bottom: "ep_inner_product_52"
  top: "ep_inner_product_52"
  name: "relu_351"
  type: RELU
}
layers {
  bottom: "ep_inner_product_52"
  top: "ep_folding_53"
  name: "folding_367"
  type: FOLDING
  folding_param {
    channels_folded: 128
    height_folded: 8
    width_folded: 8
  }
}
layers {
  bottom: "ep_folding_53"
  top: "ep_upsample_54"
  name: "upsample_383"
  type: UPSAMPLING
  upsampling_param {
    kernel_size: 2
  }
}
layers {
  bottom: "ep_upsample_54"
  top: "ep_conv_5x5_1_55"
  name: "conv_5x5_1_399"
  type: CONVOLUTION
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 64
    pad: 2
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "dec_mask_conv1_w"
  param: "dec_mask_conv1_b"
}
layers {
  bottom: "ep_conv_5x5_1_55"
  top: "ep_conv_5x5_1_55"
  name: "relu_415"
  type: RELU
}
layers {
  bottom: "ep_conv_5x5_1_55"
  top: "ep_upsample_56"
  name: "upsample_431"
  type: UPSAMPLING
  upsampling_param {
    kernel_size: 2
  }
}
layers {
  bottom: "ep_upsample_56"
  top: "ep_conv_5x5_1_57"
  name: "conv_5x5_1_447"
  type: CONVOLUTION
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 32
    pad: 2
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "dec_mask_conv2_w"
  param: "dec_mask_conv2_b"
}
layers {
  bottom: "ep_conv_5x5_1_57"
  top: "ep_conv_5x5_1_57"
  name: "relu_463"
  type: RELU
}
layers {
  bottom: "ep_conv_5x5_1_57"
  top: "ep_upsample_58"
  name: "upsample_479"
  type: UPSAMPLING
  upsampling_param {
    kernel_size: 2
  }
}
layers {
  bottom: "ep_upsample_58"
  top: "ep_t1_conv_5x5_1_426"
  name: "t1_conv_5x5_1_495"
  type: CONVOLUTION
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 1
    pad: 2
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "dec_mask_conv3_w"
  param: "dec_mask_conv3_b"
}
layers {
  bottom: "ep_split_59"
  bottom: "rotations2"
  top: "ep_tensor_product_60"
  name: "tensor_product_16"
  type: TENSOR_PRODUCT
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  inner_product_param {
    num_output: 512
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "tensor_view_w"
  param: "tensor_view_b"
}
layers {
  bottom: "ep_tensor_product_60"
  top: "ep_relu_61"
  name: "relu_32"
  type: RELU
}
layers {
  bottom: "ep_relu_61"
  top: "ep_split_63"
  top: "ep_split_84"
  name: "split_48"
  type: SPLIT
}
layers {
  bottom: "ep_split_62"
  bottom: "ep_split_63"
  top: "ep_concat_64"
  name: "concat_64"
  type: CONCAT
  concat_param {
    concat_dim: 1
  }
}
layers {
  bottom: "ep_concat_64"
  top: "ep_inner_product_65"
  name: "inner_product_80"
  type: INNER_PRODUCT
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  inner_product_param {
    num_output: 1024
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "dec_fc1_w"
  param: "dec_fc1_b"
}
layers {
  bottom: "ep_inner_product_65"
  top: "ep_inner_product_65"
  name: "relu_96"
  type: RELU
}
layers {
  bottom: "ep_inner_product_65"
  top: "ep_inner_product_66"
  name: "inner_product_112"
  type: INNER_PRODUCT
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  inner_product_param {
    num_output: 1024
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "dec_fc2_w"
  param: "dec_fc2_b"
}
layers {
  bottom: "ep_inner_product_66"
  top: "ep_relu_67"
  name: "relu_128"
  type: RELU
}
layers {
  bottom: "ep_relu_67"
  top: "ep_split_68"
  top: "ep_split_76"
  name: "split_144"
  type: SPLIT
}
layers {
  bottom: "ep_split_68"
  top: "ep_inner_product_69"
  name: "inner_product_160"
  type: INNER_PRODUCT
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  inner_product_param {
    num_output: 16384
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "dec_img_fc1_w"
  param: "dec_img_fc1_b"
}
layers {
  bottom: "ep_inner_product_69"
  top: "ep_inner_product_69"
  name: "relu_176"
  type: RELU
}
layers {
  bottom: "ep_inner_product_69"
  top: "ep_folding_70"
  name: "folding_192"
  type: FOLDING
  folding_param {
    channels_folded: 256
    height_folded: 8
    width_folded: 8
  }
}
layers {
  bottom: "ep_folding_70"
  top: "ep_upsample_71"
  name: "upsample_208"
  type: UPSAMPLING
  upsampling_param {
    kernel_size: 2
  }
}
layers {
  bottom: "ep_upsample_71"
  top: "ep_conv_5x5_1_72"
  name: "conv_5x5_1_224"
  type: CONVOLUTION
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 128
    pad: 2
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "dec_img_conv1_w"
  param: "dec_img_conv1_b"
}
layers {
  bottom: "ep_conv_5x5_1_72"
  top: "ep_conv_5x5_1_72"
  name: "relu_240"
  type: RELU
}
layers {
  bottom: "ep_conv_5x5_1_72"
  top: "ep_upsample_73"
  name: "upsample_256"
  type: UPSAMPLING
  upsampling_param {
    kernel_size: 2
  }
}
layers {
  bottom: "ep_upsample_73"
  top: "ep_conv_5x5_1_74"
  name: "conv_5x5_1_272"
  type: CONVOLUTION
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 64
    pad: 2
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "dec_img_conv2_w"
  param: "dec_img_conv2_b"
}
layers {
  bottom: "ep_conv_5x5_1_74"
  top: "ep_conv_5x5_1_74"
  name: "relu_288"
  type: RELU
}
layers {
  bottom: "ep_conv_5x5_1_74"
  top: "ep_upsample_75"
  name: "upsample_304"
  type: UPSAMPLING
  upsampling_param {
    kernel_size: 2
  }
}
layers {
  bottom: "ep_upsample_75"
  top: "ep_t2_conv_5x5_1_411"
  name: "t2_conv_5x5_1_320"
  type: CONVOLUTION
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 3
    pad: 2
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "dec_img_conv3_w"
  param: "dec_img_conv3_b"
}
layers {
  bottom: "ep_split_76"
  top: "ep_inner_product_77"
  name: "inner_product_336"
  type: INNER_PRODUCT
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  inner_product_param {
    num_output: 8192
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "dec_mask_fc1_w"
  param: "dec_mask_fc1_b"
}
layers {
  bottom: "ep_inner_product_77"
  top: "ep_inner_product_77"
  name: "relu_352"
  type: RELU
}
layers {
  bottom: "ep_inner_product_77"
  top: "ep_folding_78"
  name: "folding_368"
  type: FOLDING
  folding_param {
    channels_folded: 128
    height_folded: 8
    width_folded: 8
  }
}
layers {
  bottom: "ep_folding_78"
  top: "ep_upsample_79"
  name: "upsample_384"
  type: UPSAMPLING
  upsampling_param {
    kernel_size: 2
  }
}
layers {
  bottom: "ep_upsample_79"
  top: "ep_conv_5x5_1_80"
  name: "conv_5x5_1_400"
  type: CONVOLUTION
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 64
    pad: 2
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "dec_mask_conv1_w"
  param: "dec_mask_conv1_b"
}
layers {
  bottom: "ep_conv_5x5_1_80"
  top: "ep_conv_5x5_1_80"
  name: "relu_416"
  type: RELU
}
layers {
  bottom: "ep_conv_5x5_1_80"
  top: "ep_upsample_81"
  name: "upsample_432"
  type: UPSAMPLING
  upsampling_param {
    kernel_size: 2
  }
}
layers {
  bottom: "ep_upsample_81"
  top: "ep_conv_5x5_1_82"
  name: "conv_5x5_1_448"
  type: CONVOLUTION
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 32
    pad: 2
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "dec_mask_conv2_w"
  param: "dec_mask_conv2_b"
}
layers {
  bottom: "ep_conv_5x5_1_82"
  top: "ep_conv_5x5_1_82"
  name: "relu_464"
  type: RELU
}
layers {
  bottom: "ep_conv_5x5_1_82"
  top: "ep_upsample_83"
  name: "upsample_480"
  type: UPSAMPLING
  upsampling_param {
    kernel_size: 2
  }
}
layers {
  bottom: "ep_upsample_83"
  top: "ep_t2_conv_5x5_1_427"
  name: "t2_conv_5x5_1_496"
  type: CONVOLUTION
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 1
    pad: 2
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "dec_mask_conv3_w"
  param: "dec_mask_conv3_b"
}
layers {
  bottom: "ep_split_84"
  bottom: "rotations3"
  top: "ep_tensor_product_85"
  name: "tensor_product_17"
  type: TENSOR_PRODUCT
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  inner_product_param {
    num_output: 512
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "tensor_view_w"
  param: "tensor_view_b"
}
layers {
  bottom: "ep_tensor_product_85"
  top: "ep_relu_86"
  name: "relu_33"
  type: RELU
}
layers {
  bottom: "ep_relu_86"
  top: "ep_split_88"
  top: "ep_split_109"
  name: "split_49"
  type: SPLIT
}
layers {
  bottom: "ep_split_87"
  bottom: "ep_split_88"
  top: "ep_concat_89"
  name: "concat_65"
  type: CONCAT
  concat_param {
    concat_dim: 1
  }
}
layers {
  bottom: "ep_concat_89"
  top: "ep_inner_product_90"
  name: "inner_product_81"
  type: INNER_PRODUCT
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  inner_product_param {
    num_output: 1024
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "dec_fc1_w"
  param: "dec_fc1_b"
}
layers {
  bottom: "ep_inner_product_90"
  top: "ep_inner_product_90"
  name: "relu_97"
  type: RELU
}
layers {
  bottom: "ep_inner_product_90"
  top: "ep_inner_product_91"
  name: "inner_product_113"
  type: INNER_PRODUCT
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  inner_product_param {
    num_output: 1024
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "dec_fc2_w"
  param: "dec_fc2_b"
}
layers {
  bottom: "ep_inner_product_91"
  top: "ep_relu_92"
  name: "relu_129"
  type: RELU
}
layers {
  bottom: "ep_relu_92"
  top: "ep_split_93"
  top: "ep_split_101"
  name: "split_145"
  type: SPLIT
}
layers {
  bottom: "ep_split_93"
  top: "ep_inner_product_94"
  name: "inner_product_161"
  type: INNER_PRODUCT
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  inner_product_param {
    num_output: 16384
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "dec_img_fc1_w"
  param: "dec_img_fc1_b"
}
layers {
  bottom: "ep_inner_product_94"
  top: "ep_inner_product_94"
  name: "relu_177"
  type: RELU
}
layers {
  bottom: "ep_inner_product_94"
  top: "ep_folding_95"
  name: "folding_193"
  type: FOLDING
  folding_param {
    channels_folded: 256
    height_folded: 8
    width_folded: 8
  }
}
layers {
  bottom: "ep_folding_95"
  top: "ep_upsample_96"
  name: "upsample_209"
  type: UPSAMPLING
  upsampling_param {
    kernel_size: 2
  }
}
layers {
  bottom: "ep_upsample_96"
  top: "ep_conv_5x5_1_97"
  name: "conv_5x5_1_225"
  type: CONVOLUTION
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 128
    pad: 2
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "dec_img_conv1_w"
  param: "dec_img_conv1_b"
}
layers {
  bottom: "ep_conv_5x5_1_97"
  top: "ep_conv_5x5_1_97"
  name: "relu_241"
  type: RELU
}
layers {
  bottom: "ep_conv_5x5_1_97"
  top: "ep_upsample_98"
  name: "upsample_257"
  type: UPSAMPLING
  upsampling_param {
    kernel_size: 2
  }
}
layers {
  bottom: "ep_upsample_98"
  top: "ep_conv_5x5_1_99"
  name: "conv_5x5_1_273"
  type: CONVOLUTION
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 64
    pad: 2
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "dec_img_conv2_w"
  param: "dec_img_conv2_b"
}
layers {
  bottom: "ep_conv_5x5_1_99"
  top: "ep_conv_5x5_1_99"
  name: "relu_289"
  type: RELU
}
layers {
  bottom: "ep_conv_5x5_1_99"
  top: "ep_upsample_100"
  name: "upsample_305"
  type: UPSAMPLING
  upsampling_param {
    kernel_size: 2
  }
}
layers {
  bottom: "ep_upsample_100"
  top: "ep_t3_conv_5x5_1_412"
  name: "t3_conv_5x5_1_321"
  type: CONVOLUTION
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 3
    pad: 2
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "dec_img_conv3_w"
  param: "dec_img_conv3_b"
}
layers {
  bottom: "ep_split_101"
  top: "ep_inner_product_102"
  name: "inner_product_337"
  type: INNER_PRODUCT
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  inner_product_param {
    num_output: 8192
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "dec_mask_fc1_w"
  param: "dec_mask_fc1_b"
}
layers {
  bottom: "ep_inner_product_102"
  top: "ep_inner_product_102"
  name: "relu_353"
  type: RELU
}
layers {
  bottom: "ep_inner_product_102"
  top: "ep_folding_103"
  name: "folding_369"
  type: FOLDING
  folding_param {
    channels_folded: 128
    height_folded: 8
    width_folded: 8
  }
}
layers {
  bottom: "ep_folding_103"
  top: "ep_upsample_104"
  name: "upsample_385"
  type: UPSAMPLING
  upsampling_param {
    kernel_size: 2
  }
}
layers {
  bottom: "ep_upsample_104"
  top: "ep_conv_5x5_1_105"
  name: "conv_5x5_1_401"
  type: CONVOLUTION
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 64
    pad: 2
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "dec_mask_conv1_w"
  param: "dec_mask_conv1_b"
}
layers {
  bottom: "ep_conv_5x5_1_105"
  top: "ep_conv_5x5_1_105"
  name: "relu_417"
  type: RELU
}
layers {
  bottom: "ep_conv_5x5_1_105"
  top: "ep_upsample_106"
  name: "upsample_433"
  type: UPSAMPLING
  upsampling_param {
    kernel_size: 2
  }
}
layers {
  bottom: "ep_upsample_106"
  top: "ep_conv_5x5_1_107"
  name: "conv_5x5_1_449"
  type: CONVOLUTION
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 32
    pad: 2
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "dec_mask_conv2_w"
  param: "dec_mask_conv2_b"
}
layers {
  bottom: "ep_conv_5x5_1_107"
  top: "ep_conv_5x5_1_107"
  name: "relu_465"
  type: RELU
}
layers {
  bottom: "ep_conv_5x5_1_107"
  top: "ep_upsample_108"
  name: "upsample_481"
  type: UPSAMPLING
  upsampling_param {
    kernel_size: 2
  }
}
layers {
  bottom: "ep_upsample_108"
  top: "ep_t3_conv_5x5_1_428"
  name: "t3_conv_5x5_1_497"
  type: CONVOLUTION
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 1
    pad: 2
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "dec_mask_conv3_w"
  param: "dec_mask_conv3_b"
}
layers {
  bottom: "ep_split_109"
  bottom: "rotations4"
  top: "ep_tensor_product_110"
  name: "tensor_product_18"
  type: TENSOR_PRODUCT
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  inner_product_param {
    num_output: 512
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "tensor_view_w"
  param: "tensor_view_b"
}
layers {
  bottom: "ep_tensor_product_110"
  top: "ep_relu_111"
  name: "relu_34"
  type: RELU
}
layers {
  bottom: "ep_relu_111"
  top: "ep_split_113"
  top: "ep_split_134"
  name: "split_50"
  type: SPLIT
}
layers {
  bottom: "ep_split_112"
  bottom: "ep_split_113"
  top: "ep_concat_114"
  name: "concat_66"
  type: CONCAT
  concat_param {
    concat_dim: 1
  }
}
layers {
  bottom: "ep_concat_114"
  top: "ep_inner_product_115"
  name: "inner_product_82"
  type: INNER_PRODUCT
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  inner_product_param {
    num_output: 1024
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "dec_fc1_w"
  param: "dec_fc1_b"
}
layers {
  bottom: "ep_inner_product_115"
  top: "ep_inner_product_115"
  name: "relu_98"
  type: RELU
}
layers {
  bottom: "ep_inner_product_115"
  top: "ep_inner_product_116"
  name: "inner_product_114"
  type: INNER_PRODUCT
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  inner_product_param {
    num_output: 1024
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "dec_fc2_w"
  param: "dec_fc2_b"
}
layers {
  bottom: "ep_inner_product_116"
  top: "ep_relu_117"
  name: "relu_130"
  type: RELU
}
layers {
  bottom: "ep_relu_117"
  top: "ep_split_118"
  top: "ep_split_126"
  name: "split_146"
  type: SPLIT
}
layers {
  bottom: "ep_split_118"
  top: "ep_inner_product_119"
  name: "inner_product_162"
  type: INNER_PRODUCT
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  inner_product_param {
    num_output: 16384
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "dec_img_fc1_w"
  param: "dec_img_fc1_b"
}
layers {
  bottom: "ep_inner_product_119"
  top: "ep_inner_product_119"
  name: "relu_178"
  type: RELU
}
layers {
  bottom: "ep_inner_product_119"
  top: "ep_folding_120"
  name: "folding_194"
  type: FOLDING
  folding_param {
    channels_folded: 256
    height_folded: 8
    width_folded: 8
  }
}
layers {
  bottom: "ep_folding_120"
  top: "ep_upsample_121"
  name: "upsample_210"
  type: UPSAMPLING
  upsampling_param {
    kernel_size: 2
  }
}
layers {
  bottom: "ep_upsample_121"
  top: "ep_conv_5x5_1_122"
  name: "conv_5x5_1_226"
  type: CONVOLUTION
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 128
    pad: 2
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "dec_img_conv1_w"
  param: "dec_img_conv1_b"
}
layers {
  bottom: "ep_conv_5x5_1_122"
  top: "ep_conv_5x5_1_122"
  name: "relu_242"
  type: RELU
}
layers {
  bottom: "ep_conv_5x5_1_122"
  top: "ep_upsample_123"
  name: "upsample_258"
  type: UPSAMPLING
  upsampling_param {
    kernel_size: 2
  }
}
layers {
  bottom: "ep_upsample_123"
  top: "ep_conv_5x5_1_124"
  name: "conv_5x5_1_274"
  type: CONVOLUTION
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 64
    pad: 2
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "dec_img_conv2_w"
  param: "dec_img_conv2_b"
}
layers {
  bottom: "ep_conv_5x5_1_124"
  top: "ep_conv_5x5_1_124"
  name: "relu_290"
  type: RELU
}
layers {
  bottom: "ep_conv_5x5_1_124"
  top: "ep_upsample_125"
  name: "upsample_306"
  type: UPSAMPLING
  upsampling_param {
    kernel_size: 2
  }
}
layers {
  bottom: "ep_upsample_125"
  top: "ep_t4_conv_5x5_1_413"
  name: "t4_conv_5x5_1_322"
  type: CONVOLUTION
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 3
    pad: 2
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "dec_img_conv3_w"
  param: "dec_img_conv3_b"
}
layers {
  bottom: "ep_split_126"
  top: "ep_inner_product_127"
  name: "inner_product_338"
  type: INNER_PRODUCT
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  inner_product_param {
    num_output: 8192
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "dec_mask_fc1_w"
  param: "dec_mask_fc1_b"
}
layers {
  bottom: "ep_inner_product_127"
  top: "ep_inner_product_127"
  name: "relu_354"
  type: RELU
}
layers {
  bottom: "ep_inner_product_127"
  top: "ep_folding_128"
  name: "folding_370"
  type: FOLDING
  folding_param {
    channels_folded: 128
    height_folded: 8
    width_folded: 8
  }
}
layers {
  bottom: "ep_folding_128"
  top: "ep_upsample_129"
  name: "upsample_386"
  type: UPSAMPLING
  upsampling_param {
    kernel_size: 2
  }
}
layers {
  bottom: "ep_upsample_129"
  top: "ep_conv_5x5_1_130"
  name: "conv_5x5_1_402"
  type: CONVOLUTION
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 64
    pad: 2
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "dec_mask_conv1_w"
  param: "dec_mask_conv1_b"
}
layers {
  bottom: "ep_conv_5x5_1_130"
  top: "ep_conv_5x5_1_130"
  name: "relu_418"
  type: RELU
}
layers {
  bottom: "ep_conv_5x5_1_130"
  top: "ep_upsample_131"
  name: "upsample_434"
  type: UPSAMPLING
  upsampling_param {
    kernel_size: 2
  }
}
layers {
  bottom: "ep_upsample_131"
  top: "ep_conv_5x5_1_132"
  name: "conv_5x5_1_450"
  type: CONVOLUTION
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 32
    pad: 2
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "dec_mask_conv2_w"
  param: "dec_mask_conv2_b"
}
layers {
  bottom: "ep_conv_5x5_1_132"
  top: "ep_conv_5x5_1_132"
  name: "relu_466"
  type: RELU
}
layers {
  bottom: "ep_conv_5x5_1_132"
  top: "ep_upsample_133"
  name: "upsample_482"
  type: UPSAMPLING
  upsampling_param {
    kernel_size: 2
  }
}
layers {
  bottom: "ep_upsample_133"
  top: "ep_t4_conv_5x5_1_429"
  name: "t4_conv_5x5_1_498"
  type: CONVOLUTION
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 1
    pad: 2
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "dec_mask_conv3_w"
  param: "dec_mask_conv3_b"
}
layers {
  bottom: "ep_split_134"
  bottom: "rotations5"
  top: "ep_tensor_product_135"
  name: "tensor_product_19"
  type: TENSOR_PRODUCT
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  inner_product_param {
    num_output: 512
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "tensor_view_w"
  param: "tensor_view_b"
}
layers {
  bottom: "ep_tensor_product_135"
  top: "ep_relu_136"
  name: "relu_35"
  type: RELU
}
layers {
  bottom: "ep_relu_136"
  top: "ep_split_138"
  top: "ep_split_159"
  name: "split_51"
  type: SPLIT
}
layers {
  bottom: "ep_split_137"
  bottom: "ep_split_138"
  top: "ep_concat_139"
  name: "concat_67"
  type: CONCAT
  concat_param {
    concat_dim: 1
  }
}
layers {
  bottom: "ep_concat_139"
  top: "ep_inner_product_140"
  name: "inner_product_83"
  type: INNER_PRODUCT
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  inner_product_param {
    num_output: 1024
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "dec_fc1_w"
  param: "dec_fc1_b"
}
layers {
  bottom: "ep_inner_product_140"
  top: "ep_inner_product_140"
  name: "relu_99"
  type: RELU
}
layers {
  bottom: "ep_inner_product_140"
  top: "ep_inner_product_141"
  name: "inner_product_115"
  type: INNER_PRODUCT
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  inner_product_param {
    num_output: 1024
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "dec_fc2_w"
  param: "dec_fc2_b"
}
layers {
  bottom: "ep_inner_product_141"
  top: "ep_relu_142"
  name: "relu_131"
  type: RELU
}
layers {
  bottom: "ep_relu_142"
  top: "ep_split_143"
  top: "ep_split_151"
  name: "split_147"
  type: SPLIT
}
layers {
  bottom: "ep_split_143"
  top: "ep_inner_product_144"
  name: "inner_product_163"
  type: INNER_PRODUCT
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  inner_product_param {
    num_output: 16384
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "dec_img_fc1_w"
  param: "dec_img_fc1_b"
}
layers {
  bottom: "ep_inner_product_144"
  top: "ep_inner_product_144"
  name: "relu_179"
  type: RELU
}
layers {
  bottom: "ep_inner_product_144"
  top: "ep_folding_145"
  name: "folding_195"
  type: FOLDING
  folding_param {
    channels_folded: 256
    height_folded: 8
    width_folded: 8
  }
}
layers {
  bottom: "ep_folding_145"
  top: "ep_upsample_146"
  name: "upsample_211"
  type: UPSAMPLING
  upsampling_param {
    kernel_size: 2
  }
}
layers {
  bottom: "ep_upsample_146"
  top: "ep_conv_5x5_1_147"
  name: "conv_5x5_1_227"
  type: CONVOLUTION
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 128
    pad: 2
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "dec_img_conv1_w"
  param: "dec_img_conv1_b"
}
layers {
  bottom: "ep_conv_5x5_1_147"
  top: "ep_conv_5x5_1_147"
  name: "relu_243"
  type: RELU
}
layers {
  bottom: "ep_conv_5x5_1_147"
  top: "ep_upsample_148"
  name: "upsample_259"
  type: UPSAMPLING
  upsampling_param {
    kernel_size: 2
  }
}
layers {
  bottom: "ep_upsample_148"
  top: "ep_conv_5x5_1_149"
  name: "conv_5x5_1_275"
  type: CONVOLUTION
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 64
    pad: 2
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "dec_img_conv2_w"
  param: "dec_img_conv2_b"
}
layers {
  bottom: "ep_conv_5x5_1_149"
  top: "ep_conv_5x5_1_149"
  name: "relu_291"
  type: RELU
}
layers {
  bottom: "ep_conv_5x5_1_149"
  top: "ep_upsample_150"
  name: "upsample_307"
  type: UPSAMPLING
  upsampling_param {
    kernel_size: 2
  }
}
layers {
  bottom: "ep_upsample_150"
  top: "ep_t5_conv_5x5_1_414"
  name: "t5_conv_5x5_1_323"
  type: CONVOLUTION
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 3
    pad: 2
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "dec_img_conv3_w"
  param: "dec_img_conv3_b"
}
layers {
  bottom: "ep_split_151"
  top: "ep_inner_product_152"
  name: "inner_product_339"
  type: INNER_PRODUCT
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  inner_product_param {
    num_output: 8192
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "dec_mask_fc1_w"
  param: "dec_mask_fc1_b"
}
layers {
  bottom: "ep_inner_product_152"
  top: "ep_inner_product_152"
  name: "relu_355"
  type: RELU
}
layers {
  bottom: "ep_inner_product_152"
  top: "ep_folding_153"
  name: "folding_371"
  type: FOLDING
  folding_param {
    channels_folded: 128
    height_folded: 8
    width_folded: 8
  }
}
layers {
  bottom: "ep_folding_153"
  top: "ep_upsample_154"
  name: "upsample_387"
  type: UPSAMPLING
  upsampling_param {
    kernel_size: 2
  }
}
layers {
  bottom: "ep_upsample_154"
  top: "ep_conv_5x5_1_155"
  name: "conv_5x5_1_403"
  type: CONVOLUTION
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 64
    pad: 2
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "dec_mask_conv1_w"
  param: "dec_mask_conv1_b"
}
layers {
  bottom: "ep_conv_5x5_1_155"
  top: "ep_conv_5x5_1_155"
  name: "relu_419"
  type: RELU
}
layers {
  bottom: "ep_conv_5x5_1_155"
  top: "ep_upsample_156"
  name: "upsample_435"
  type: UPSAMPLING
  upsampling_param {
    kernel_size: 2
  }
}
layers {
  bottom: "ep_upsample_156"
  top: "ep_conv_5x5_1_157"
  name: "conv_5x5_1_451"
  type: CONVOLUTION
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 32
    pad: 2
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "dec_mask_conv2_w"
  param: "dec_mask_conv2_b"
}
layers {
  bottom: "ep_conv_5x5_1_157"
  top: "ep_conv_5x5_1_157"
  name: "relu_467"
  type: RELU
}
layers {
  bottom: "ep_conv_5x5_1_157"
  top: "ep_upsample_158"
  name: "upsample_483"
  type: UPSAMPLING
  upsampling_param {
    kernel_size: 2
  }
}
layers {
  bottom: "ep_upsample_158"
  top: "ep_t5_conv_5x5_1_430"
  name: "t5_conv_5x5_1_499"
  type: CONVOLUTION
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 1
    pad: 2
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "dec_mask_conv3_w"
  param: "dec_mask_conv3_b"
}
layers {
  bottom: "ep_split_159"
  bottom: "rotations6"
  top: "ep_tensor_product_160"
  name: "tensor_product_20"
  type: TENSOR_PRODUCT
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  inner_product_param {
    num_output: 512
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "tensor_view_w"
  param: "tensor_view_b"
}
layers {
  bottom: "ep_tensor_product_160"
  top: "ep_relu_161"
  name: "relu_36"
  type: RELU
}
layers {
  bottom: "ep_relu_161"
  top: "ep_split_163"
  top: "ep_split_184"
  name: "split_52"
  type: SPLIT
}
layers {
  bottom: "ep_split_162"
  bottom: "ep_split_163"
  top: "ep_concat_164"
  name: "concat_68"
  type: CONCAT
  concat_param {
    concat_dim: 1
  }
}
layers {
  bottom: "ep_concat_164"
  top: "ep_inner_product_165"
  name: "inner_product_84"
  type: INNER_PRODUCT
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  inner_product_param {
    num_output: 1024
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "dec_fc1_w"
  param: "dec_fc1_b"
}
layers {
  bottom: "ep_inner_product_165"
  top: "ep_inner_product_165"
  name: "relu_100"
  type: RELU
}
layers {
  bottom: "ep_inner_product_165"
  top: "ep_inner_product_166"
  name: "inner_product_116"
  type: INNER_PRODUCT
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  inner_product_param {
    num_output: 1024
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "dec_fc2_w"
  param: "dec_fc2_b"
}
layers {
  bottom: "ep_inner_product_166"
  top: "ep_relu_167"
  name: "relu_132"
  type: RELU
}
layers {
  bottom: "ep_relu_167"
  top: "ep_split_168"
  top: "ep_split_176"
  name: "split_148"
  type: SPLIT
}
layers {
  bottom: "ep_split_168"
  top: "ep_inner_product_169"
  name: "inner_product_164"
  type: INNER_PRODUCT
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  inner_product_param {
    num_output: 16384
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "dec_img_fc1_w"
  param: "dec_img_fc1_b"
}
layers {
  bottom: "ep_inner_product_169"
  top: "ep_inner_product_169"
  name: "relu_180"
  type: RELU
}
layers {
  bottom: "ep_inner_product_169"
  top: "ep_folding_170"
  name: "folding_196"
  type: FOLDING
  folding_param {
    channels_folded: 256
    height_folded: 8
    width_folded: 8
  }
}
layers {
  bottom: "ep_folding_170"
  top: "ep_upsample_171"
  name: "upsample_212"
  type: UPSAMPLING
  upsampling_param {
    kernel_size: 2
  }
}
layers {
  bottom: "ep_upsample_171"
  top: "ep_conv_5x5_1_172"
  name: "conv_5x5_1_228"
  type: CONVOLUTION
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 128
    pad: 2
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
  param: "dec_img_conv1_w"
  param: "dec_img_conv1_b"
}
layers {
  bottom: "ep_conv_5x5_1_172"
  top: "ep_conv_5x5_1_172"
  name: "relu_244"
  type: RELU
}
layers {
  bottom: "ep_conv_5x5_1_172"
  top: "ep_upsample_173"
  name: "upsample_260"
  type: UPSAMPLING
  upsampling_param {
    kernel_size: 2
  }
}
